Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON ID>EN Tales of Sarimin The Jinn.tmx
Source language: id
Languages: en

source: WAKTU!
en: time!

source: AKAN AMAN..
en: I’ll be fine...

source: MEREKA..
en: to deal with.

source: SI-SIAL!!
en: What the-?!

source: HAVE
en: a nice

source: ..BEBERAPA
en: some of the workers

source: Tentu saja aku akan hati-hati!
en: of course, I’ll be careful.

source: DIA KUNCINYA!!
en: he is the key!

source: Ayo, mbah Suro!
en: go, master suro!

source: BAJU GANTI?
en: whenever you go to work.

source: ET!
en: (redacted)

source: UWAAA!!!
en: waaa!!!

source: SESUATU!!!
en: mr. sunaryo!

source: NANI..!?
en: what?!

source: UJARNYA
en: he said.

source: DIKASIH PROYEK KECIL
en: you couldn’t even

source: Minta diusir, ya?
en: you don’t need a place to stay any longer?

source: TOLONG AKU!!
en: help me!!!

source: KLONTANG
en: clank

source: ..DIGEBUKI
en: being beaten

source: BENAR JUGA
en: that’s right...

source: (KOK BAUNYA FAMILIAR, YAH?)
en: (smells familiar...)

source: SARIMINNIE
en: sarimin!

source: KUPIKIR
en: I thought

source: SALAH FOKUS
en: he keeps losing

source: ANTAR AKU
en: take me

source: BLARR
en: kaboom

source: SEORANG AHLI DUNIA
en: the master

source: TIDAK USAH
en: argh, no need

source: Ta..
en: b-

source: SUDAH DIJAMPI-JAMPI..
en: that has been blessed with some spells.

source: ..SIAPA AKU?!
en: who am I?

source: MENGGUNAKAN
en: such

source: NGEENG!
en: vroom

source: NANTI
en: you know, the author

source: TRESNO
en: agonizing scream.

source: BANYAK ALASAN!!
en: to play coy with me!

source: Beruntung, kami dapat mengamankan pusaka tersebut sebelum dihancurkan oleh oknum kura-kura ninja
en: luckily, we were able to secure the heirloom before the turtle shaman could destroy it.

source: WUJUDMU
en: you

source: JUGA DIAM SAJA,
en: just stay quiet

source: Ini barusan nendang lagi, nih..
en: the baby just started kicking again.

source: Apakah urusan boss Sima dengan tuan Sarimin sudah selesai?
en: are you done with mr. Sarimin, sir?

source: DIA ADALAH
en: meet

source: DARIKU..!!
en: from

source: Apa sekarang sudah mau mendengar proposalku?
en: are you all set to hear the rest of my presentation?

source: Sayangnya kekuatan yang kami miliki saat ini belum memenuhi standar untuk menjalankan praktik pesugihan secara legal
en: unfortunately, our current power level doesn’t meet the legal requirements for practicing black magic.

source: SAYA…
en: understand.

source: KAN??
en: right?

source: TELAH MATI DI TANGAN
en: dying in the hands of a jinn

source: C-CALON?
en: g-girlfriend?

source: DUANYA DAN SEHAT,
en: they’re still healthy,

source: JANGAN AMBIL PUTRIKU!!
en: don’t take my daughter!!!

source: AH, I-ITU
en: we can take care of it

source: BEGITU!?
en: like that?!

source: Sabarlah sampai saat itu!
en: just be patient until then.

source: AKU JUGA TIDAK
en: I don’t want

source: KATANYA KEMARIN KAMU
en: I thought

source: KAMI BERDUA SUDAH BERKELILING, TAPI RASANYA SEPERTI HANYA BERPUTAR-PUTAR DI DAERAH TERTENTU SAJA..
en: it seems like we keep going back to the same places over and over again.

source: MASING-MASING
en: they dreamed

source: GYAHH…!!
en: gaaah!!!

source: DENGAN KALIAN YANG
en: connected to

source: RATNA KOK DIAM
en: she hasn’t said anything

source: ALAM, PAK..
en: sir...

source: SUDAH BANYAK
en: I’ve learned

source: SAAKK
en: rustle

source: GHOIB?!
en: huh?!

source: NGGAK, KAKIMU
en: come here,

source: APA KAU PUNYA
en: any

source: TIDAK HANYA MUDAH
en: beating you

source: Kenapa tidak ada yang menyahut?!
en: can anyone hear me?!

source: MENGALAHKANMU..
en: is a piece of cake!

source: MAKHLUK APA ITU?!!?
en: what is that?!

source: TIDAK PERLU
en: even without an

source: SEPERTINYA TELAH
en: with that face

source: KIKIKK KIKKKK!!!
en: eek eek!!!

source: LELAHAN YA,
en: on your limit, huh,

source: Kanan..
en: look right,

source: KALAU BEGINI
en: at this

source: NGAPAIN..?
en: doing here?!

source: YAA AKU
en: well, I need

source: KURANG AJAR!!!
en: son of a gun!!!

source: ..TERLALU
en: it

source: MAMAHNYA JUGA SAMA AJA DULU SUKA NGITUNGIN KUBURAN KALAU NAIK KERETA...
en: back then, whenever we took the train, your mom would also count graves...

source: AGAR KAU DIHUJAT NETIJEN SE-INDONESIA!!!
en: so the whole country will know of your despicable acts!!!

source: TIBA BEGINI…
en: he want?

source: UDAH, KAK...
en: enough, dear.

source: INI!?!?!
en: here!!!

source: AKU SANGAT
en: I really need

source: NGGAK BISA,
en: sorry,

source: SAKIT MENDADAK..
en: and some fell sick.

source: LABI-LABI..!!!
en: punches!!!

source: PEKERJAAN SAMPINGAN
en: about

source: ...Hmphh!!
en: tsk!

source: TERBUKA-
en: please

source: DAN CEK SEMUA PER-
en: and always check

source: AKU SUDAH MENDAPAT KABAR..
en: I’ve been informed of what happened.

source: PISANG?!
en: peel?!

source: FAKTANYA,
en: in fact,

source: Meskipun terlihat malas-malasan, aku ini diam-diam kerja kerah , lho!!
en: even though I appear to be lazy, you should know that I've been actually working very hard!

source: Jangan marahi aku, mbah Suro!!
en: don’t get mad at me, master suro!

source: BERARTI DI SINI CUMA
en: I guess

source: SRAK!!
en: rustle

source: DARAH..
en: you monkey!

source: BOLEH BUAT
en: helped.

source: SAYA MAKLUM
en: look, I understand

source: BERHATI-HATI-LAH..
en: be careful out there.

source: PETAKA..
en: for being a simpette.

source: AYAH YANG MATIIN TADI SEBELUM BERANGKAT..
en: I’ve turned it off right before we left.

source: SIAPA KAU?!
en: who are you?!

source: 7 hari lebih dari cukup, aku bisa membangun 7000 candi dengan waktu selama itu, hahaha
en: 7 days would be more than enough time for me to build 7,000 temples, hahaha.

source: BR
en: shove

source: ..NGAPAIN
en: what

source: ..MAU LEWAT
en: is this

source: PERSILAHKAN
en: feel free to do so.

source: BUKAN MANUSIA,
en: not a human,

source: MBAK BISA
en: take a look

source: DEKAT!!
en: you smell

source: JUMPA LAGI DENGAN SAYA, SHELLY..
en: back with me, shelly.

source: TOLONG SEGERA
en: leave this area immediately.

source: KEMBALI..
en: back.

source: ZHAAA
en: swoosh

source: *KEPAK*
en: *flap*

source: Cukup antar saja makanannya, jangan macam-macam pokoknya!!!
en: just deliver the dish and stay out of trouble.

source: KECELAKAAN TRESNO
en: it wasn’t

source: ACCCCCCKKKKK!!!
en: no, no, stop!!!

source: GAMBAR ADEGAN
en: draw action

source: SILUET
en: a human

source: Males banget kalau harus bolak-balik nganterin ini sampai penghuni kamar buka pinty!
en: it would be troublesome if I had to keep going back and forth until the guest opened the door!

source: SUDAH SAYA BAYAR LUNAS PULA!!
en: and paid for it in full!

source: BELUM KERAMAS
en: haven’t washed

source: PAK J..
en: J...

source: KALAU CUMA
en: if that’s

source: Benar ini jalannya!!
en: this is the right way!

source: Kita jadi pulang sekarang, kan?
en: we’re leaving today, right?

source: KAMU SAJA
en: move him

source: ...KIK..
en: eek...

source: TUBUH TRESNO..
en: tresno’s body

source: SAYA DI PERTIKAIAN
en: out of

source: AKU LUPA KALAU
en: I almost forgot

source: SEBENARNYA?!?!
en: this place?!

source: TAPI SEBENTAR LAGI AKAN GELAP..
en: but it’s getting dark soon.

source: A…ATAU
en: no...

source: JADI AKU
en: therefore,

source: DI SINI, PAK J!?
en: mr. J?

source: YANG SUDAH DIA
en: has he

source: KATAKAN!
en: spit it out!

source: KAN SUDAH KUBILANG, YANG PENTING ITU KONTAK KOLEGA DI DALAMNYA!!
en: I told you that phone had a lot of important contacts!

source: HITUNG JUMLAH
en: how much money

source: KERJA DI SINI
en: I work here.

source: SAYA MAU BUANG
en: I need

source: UANGNYA…
en: is in...

source: SWOOO
en: swoosh

source: CENAYANG?
en: a psychic?

source: M-MAS MENGERTI
en: I-I understand

source: *TRESNO (BAHASA JAWA) ARTINYA "CINTA"
en: *in javanese, “tresno” means “love.”

source: DAN
en: and

source: BANJIR LAGI?!
en: flooding!

source: KESEMPATAN
en: well,

source: MUNGKIN SAJA KITA BISA TOLONG ORANG SINI UNTUK--- ACK!!!
en: maybe the locals can help me find the.. ouch!

source: RUANGAN INI LEBIH
en: seems to be much more

source: TAMAT?!
en: the ending?!

source: DENGAN MAKHLUK
en: afraid,

source: (HEHEHE, RASAIN LO DASAR BOCAH!!)
en: serves you right, kid!

source: SEPERTI INI..!!
en: like this!

source: KORBANNYA?
en: to be the victim?

source: APAKAH KAMU
en: do you know

source: DINASEHATI ITU..
en: you need to have a talk with him.

source: TAKKAN
en: I won’t

source: Mamamaafkan saya, tuan!!
en: p-please excuse my impudence, sir!

source: HADEEEHH…
en: a long, long journey...

source: APA BOLEH
en: it can’t

source: WOI!!
en: hei!

source: LINGKUNGAN
en: the environment

source: DI LAHAN ORANG, KAU
en: to make out at someone’s place.

source: SENDIRI..!!
en: by itself!

source: KULAPORKAN KE
en: need

source: Seakan-akan tuan Sima memang menginginkan kita menemukan anak itu, mbah!
en: it seemed as if master sima wanted us to find her.

source: APA
en: wasn’t

source: KETEMUAN DI SINI
en: to meet you.

source: ..APAKAH AKU
en: maybe I was

source: Siapa yang kuceng garong pelit?
en: who did you call a lousy cheapskate?

source: NG!!
en: (redacted)

source: KAU PASTI SUDAH
en: do you

source: BERHASIL KITA UNDANG
en: our guest

source: IHHH SI MAS
en: stop

source: DIA TIDAK BISA MEN-
en: he can’t hear

source: DIANDALKAN
en: deal with this matter.

source: PAANZI.
en: whatever.

source: BENERAN NGGAK ADA DI TENDA, YAH..
en: look, I couldn’t find her in the tent.

source: MI-MIMPI APA
en: what was

source: JUGA TIDAK SOPAN
en: besides, how would

source: LAKNAT
en: REPUGNANT

source: JIN MONYET PUTIH
en: the white

source: CARA PRIA ITU MENYU-
en: because of

source: AKU TIDAK BERMAIN-
en: messing around

source: RAMBUT DUKUN..
en: just slap me

source: DULU.
en: fight,

source: YAAHH…
en: oh, well,

source: SATU, YA?
en: take one of them?

source: ENTAHLAH..
en: I don’t know...

source: MENARIK JUGA..
en: I’m kinda intrigued.

source: BEGITU..?
en: huh?

source: KE..
en: wh-

source: Merekalah yang akan membantu mengklaim kembali wilayahku
en: and they are the ones who will assist me in reclaiming my territory.

source: WAAHH..
en: whoa...

source: ..JIN
en: a

source: Pokoknya intinya adalah-- aku sudah menyiapkan sebuah masterplan!!
en: well, the point is that I already have a master plan!

source: SAJA DARITADI?
en: since I got here...

source: ..AKU TIDAK AKAN
en: I swear

source: KIKK!!
en: eekkk!!!

source: JANGAN PERGI SEN-DIRI, BAHAYA!!
en: don’t wander off! it’s dangerous!

source: APA-
en: what

source: ..SETELAH ITU
en: after that, I promise

source: MENGKHAWATIRKAN
en: alarming.

source: DENDAM..?!
en: huh?

source: AWALNYA TUBUHKU
en: I'm beginning

source: AKU ADA URUSAN
en: I have

source: Tenang saja aku tidak berniat untuk gagal
en: relax, I’m not going to fail.

source: Cara itu selalu berhasil tanpa menimbulkan kecurigaan
en: that method has never resulted in any suspicions so far.

source: PAK..
en: mister...

source: KAMU INGAT DENGAN
en: do you remember

source: YULLIE PASTI
en: yullie

source: DAN DENGARKAN
en: and listen to me

source: NAH, PISANGNYA
en: look,

source: ATAN JIN BULUS
en: bulus jimbung’s

source: MONYET ITU?
en: that monkey?

source: MAU DITEMENIN
en: want

source: DIPIKIR-PIKIR MUMPUNG
en: now that you’re here,

source: ACK--!!
en: ouch!

source: ORANG
en: I was

source: DAHSYAT DARI
en: powerful

source: SEPOTONG KAKI INI
en: this leg

source: Tempat/ Tgl Lahir
en: Date of Birth

source: HUHHH?!
en: huh?!

source: PLEK!
en: slap

source: Ack!
en: eek!

source: LAGIPULA
en: besides,

source: JENGUK AYAH DI
en: my sweet baby girl

source: SELESAIKAN
en: finish

source: DAN HIDUP ENAK
en: to a better life.

source: PERBUATAN KALIAN,
en: the favor,

source: IYA!
en: yeah!

source: AYAH, TUH…
en: at us!

source: JADI TIDAK ADA YANG
en: there’s

source: SYUUU
en: swoosh

source: M-MAAFKAN AKU!!
en: forgive me!

source: MAU KITA CARI-
en: maybe we can

source: MALAH BOSSNYA INI
en: showed up instead.

source: SILAKAN
en: please

source: Rencana kita memang mengalami sedikit gangguan, tapi percaya ada jalan lain yang diinginkan oleh tuan Sima!
en: in spite of the setback we encountered, I’m confident that master sima has other plans in mind!

source: ITU GOGOL MAP-NYA
en: look at the GPS!

source: Kaget kan?
en: didn’t see it coming, did you?

source: NGITUNGIN KUBURAN YANG UDAH KITA LEWATIN, MAH!
en: I was just keeping track of how many graves we went by!

source: SUNGGUH MENARIK!
en: interesting idea!

source: TIDAK ADA
en: there’s

source: DASAR BERISIK!!
en: I get it!

source: JANGAN LARI-LARI,
en: to stop running

source: SUDAH KAU LAKUKAN
en: you done

source: KALI INI
en: something’s

source: MENGAMBIL TANGANMU..
en: your arms...

source: MEMANG TIDAK PERCAYA!
en: has never believed this stuff,

source: SAJA AKAN ADA
en: anymore.

source: MAIN NYELONONG SAJA
en: they didn’t even bother

source: EH-TUNGGU, KOK
en: huh? wait,

source: WAHAI MANUSIA..!!
en: you mortals!

source: SEPERTI TRESNO, TAPI
en: as tresno, the number

source: PAK, SEBELUMNYA
en: pardon

source: KE SINI..
en: here.

source: DUKUN YANG MEMINJAM
en: that I was the only shaman

source: *TUING*
en: fwip

source: ADALAH MILIK KALIAN!
en: belongs only to you!

source: Kok aq sichh!?
en: why me?!

source: T-TOLONG AKU!!
en: h-help me!!!

source: AKU BUKAN--
en: I’m not--

source: KAMU PULANG DULU
en: you’d better

source: GHOIB
en: adit.

source: AKU SUDAH LAPOR KE PENJAGA..
en: I’ve reported her missing to one of the guards.

source: AKK!
en: (redacted)

source: HHHAA…
en: huff...

source: TAJIR, DEH!
en: in money.

source: HAL-HAL MISTIS?
en: their presence?

source: INJAK!!
en: step on

source: Uhuk..
en: ahem...

source: ...INI...
en: where

source: C..
en: h-

source: AKU DATANG
en: I’ve come

source: KACAMATAKU!!!
en: my glasses!

source: BANGUNAN DI SINI!!
en: on our ground!

source: HEI, KAMU!!
en: hey, you!

source: NGGAK PERLU
en: I don’t

source: CTAR
en: boom

source: LUAR
en: so

source: KAU NONGOL DI
en: in which episode

source: Kita kan teman lama!!
en: we’re old friends!

source: HAHA, IYA..
en: hahaha... fine,

source: KITA JADI SAMPAI
en: that we didn’t know

source: Terimakasih banyak..
en: we’ll forever be indebted to you!

source: BIARKAN SAJA, MAH..
en: let her be...

source: EHEM..
en: ahem...

source: DAN BOWO TIDAK
en: the truck’s engine

source: DONG!
en: you know!

source: 'DIA'
en: power.

source: *GETAR*
en: *tremble*

source: KAMU BISA MELIHAT SIMA SEBAGAI MACAN JEJADIAN?
en: so you could see sima as a tiger familiar?

source: Masih belum terlambat kan, sayang?
en: it’s not too late, right, baby?

source: NGGAK KERASA
en: we got carried away

source: CIH!
en: oh,

source: BELIAU INGIN SEGERA
en: he wants

source: JADI SEKACAU
en: be this complicated.

source: SERIBU BINTANG
en: to a thousand-star hotel.

source: JALANNYA NGGAK FAMILIAR SAMA SEKALI..
en: I don’t remember walking through here...

source: SI ITU' SIAPA YANG KAU BICARAKAN!!??!?!
en: what do you mean by “that guy,” huh?

source: MENGECEWAKAN
en: let you down,

source: MAH, JANGAN MELENG DARI JALAN, DONG..
en: honey, keep your eyes on the road.

source: MAAF..
en: I’m really sorry...

source: KATANYA SINYALNYA MENJANGKAU SEMUA
en: they advertised that their coverage is available everywhere!

source: BARANG BERHARGA?!
en: valuables?

source: Kamu lagi nggak ngidam apa-apa kan?
en: anyway... what are you craving?

source: Oho?
en: hmm?

source: SUDAHLAH,
en: we’re done here,

source: MASA BARU KAYA
en: you need

source: TSK, DARITADI
en: tsk...

source: Anda pasti terkejut ya, pak?
en: surprised, huh?

source: KOK DARITADI MASIH SIBUK AJA, SIH?
en: why are you still so busy?

source: NGOMONG CERITAMU
en: your story

source: NGEPET INI LATIHAN?
en: practice.

source: SESEMBAHAN
en: I’ve prepared

source: MELALUI BONEKA
en: through the doll,

source: MASIH BELUM MAU
en: they’re

source: Handphone terbaru..
en: one of the newest phones?

source: ..AKU JUGA
en: huff... I think

source: WAHAHAHA..
en: hahaha.

source: *NGGAK DENGAR*
en: *busy with his phone*

source: BECUS NGURUSNYA!!
en: like this, huh?!

source: SECARA PERMANEN
en: permanently.

source: TERPELESET..
en: some slipped into a ditch...

source: Ah, sh*t..
en: shoot...

source: NAT HARUS DIKASIH TAU AGAR TIDAK BEGINI LAGI!!
en: you should teach her a lesson so this won’t happen again!!!

source: NGAPAIN BAPAK
en: what are

source: BEGITUAN!
en: any of things!

source: BIASANYA..
en: than usual.

source: SAYA KAN SUDAH BOOKING DARI WEBSITE?!
en: I’ve made an online reservation

source: ADUDUUH,
en: oh, man!

source: HUUHUU..
en: sob sob...

source: SEBERAPA BESAR
en: to see how much

source: AKU BENCI AYAH!!!!
en: I hate you, dad!

source: APAPUN KE AYAH
en: to

source: MASIH ADA
en: what

source: YHA…
en: oh...

source: PIKIR PENGHUNI SINI
en: have you thought about

source: SUDAH KUBILANG,
en: let me tell you,

source: LAGI KABUR DARI
en: I’ll never run away

source: AKU KEHILANGAN
en: I’m gonna lose

source: DIAM SAJA..
en: still quiet.

source: DARI SINI!!?
en: here!!!

source: Tapi untuk mewujudkan masterplan ini, aku butuh bantuanmu, Siwa!!!
en: to carry out this grand scheme, I need your help, sima!

source: YANG DILAKUKAN
en: wasa’s

source: BASINYA..
en: to the point...

source: ADA YANG ANEH DENGAN TEMPAT INI...
en: there’s something off about this place.

source: BAGAIMANA INI?!!?
en: how’s this possible?!

source: Aku kan emang baik hati dan tidak sombong
en: I am genuinely nice to everyone!

source: (DASAR MANUSIA SERAKAH!!
en: (you greedy human!

source: AYAH..
en: dad

source: AKU HARUS MENYE-
en: I need

source: SEKARANG DENGARKAN AKU BAIK-BAIK..
en: now, listen carefully...

source: KALIAN!!
en: this!

source: TADI BENAR LEWAT SINI, KAN?
en: am I on the right track?

source: APALAGI?
en: and come

source: M..
en: y-

source: Orang-orang seperti kalian tidak akan bisa mengerti kondisi kami..
en: people like you won’t get it.

source: Kau..
en: oh...

source: MALU-MALU, ABANG!!
en: to be embarrassed, big bro!

source: KAMU KALO KAMU
en: if you

source: KAU ADALAH JIN
en: you were

source: DARI INI!!
en: to happen!

source: Hadehhh...
en: give me a break...

source: ..DAN APABILA
en: tsk...

source: BUKANNYA INGIN BERTEMU
en: just to meet my slave

source: Ada penyusup!!
en: we have trespassers!

source: MAKANYA AKU TIDAK SUKA KALAU DITITIP-TITIPIN ANAK BEGINI!!
en: this is why I don’t like leaving things up to other people!!!

source: AKHIRNYA NGAKU..
en: gotcha...

source: TERPENTING, BELIAU
en: importantly,

source: KALAU NGGAK SIBUK, YA TIDUR DOANG DI KAMAR..
en: when he didn’t have to work, he would just lounge around in his room,

source: BISA-BISA BENERAN
en: you’ll die

source: MAH, COBA PINJAM HAPE-NYA BUAT TETHER--GAAHHH!!!
en: honey, can I use your phone’s wifi to connect… gaaah!!!

source: DI SAAT SEPERTI
en: I’m in real trouble

source: TERNYATA MBAH
en: but tirta

source: HEAAHHH!!!!
en: come here!!!

source: KENAPA AKU
en: why am I

source: TIDAK ADA GUNA-
en: change

source: TIBA BISA SAMPAI
en: end up

source: DI AUTOPSI PUN
en: autopsy, it’s pretty clear,

source: AKU MINTA..
en: ...a comb

source: Gimana?
en: how is it going?

source: TOH KITA SUDAH
en: this is what

source: DONG..
en: next time, adit.

source: TINGGAL SATU
en: one of them

source: Fyi, di negara ini, rata-rata ada tiga (3) orang yang meninggal dunia karena kecelakaan di jalan..
en: on average, three people are killed in road accidents every day in this country.

source: MENGUNDANGKU..
en: thank you for inviting

source: Kau tidak perlu setuju dengan cara yang kulakukan, tapi tidak usah ikut campur dengan merubah tradisi yang sudah lama terbentuk!!
en: you don’t have to agree with the way I do things, just don’t mess with it!

source: KAMU BELAJAR NGANCEM GINI DARI SIAPA!!??
en: where did you learn how to blackmail?!

source: BERTEMU BEBERAPA
en: several years

source: SIAL MELULU…
en: my luck...

source: HAL-HAL SEPERTI ITU..
en: in this stuff...

source: DI RUANGAN INI
en: to

source: TUAN SARIMIN..!!
en: master sarimin!

source: MAKASIH, MAS,
en: Thank you.

source: MALAM ITU!!
en: that night.

source: DARIPADA NANTI
en: I don’t want

source: MALAH TERPESONA
en: getting swooned

source: TIDAK PENTING!!!
en: keep it for later.

source: SEGERA MENGAMAN-
en: secure

source: DULU SAJA!
en: for the time being.

source: PUN AKU HANYA
en: want

source: FANCY GITU, KEK!!
en: and have a fancy dinner!

source: INI AYAH!!!
en: it’s me!

source: KARYAWAN YANG BEBE-
en: the man who took

source: DENGAN JIWA WASA..
en: see wasa...

source: CAPEK?
en: you know? hahaha!

source: APAPUN, KALIAN HARUS
en: before you started

source: Kami siap..
en: we’re prepared...

source: Dia baik skali!!!!
en: he’s so kind!!!

source: LAGI MEMILIKI URUSAN
en: are no longer

source: Oh, hai Pita!
en: oh! hi, pita!

source: MAKASIH!!!
en: thank you!

source: BU-BUKANKAH
en: b-but

source: JAWABLAH DENGAN
en: why don’t

source: WASA PUNYA UNIT
en: that wasa owned

source: PUTIH..?!
en: here?!

source: GINI!?!?
en: ghosts?!

source: PAKAI ALAT YANG
en: gotten

source: KALAU ADA APA-APA LANGSUNG TANYA PETUGAS YANG BERJAGA SAJA!
en: feel free to reach our staffs if you need anything.

source: Sebelah sini, mah!!
en: over here!

source: DENGAN KERJAAN
en: something to do

source: PAK SURYONO
en: mr. suryono

source: AKHIR
en: the end

source: HEI, SI CULUN!
en: hey, four-eyes!

source: KALIAN CEK LAGI PER-
en: you should check your safety equipment

source: AKU KETIDURAN
en: I was

source: Meskipun sambat, kamu tetap akan membantuku kan , Siwa??!!?
en: you say that, but you're still going to help me, right?!

source: KITA TINGGALKAN
en: leave it alone

source: Tumbal telah tiba!!
en: the human sacrifice!

source: HMPH, SUDAH KU-PERINGATKAN..
en: didn’t I tell you already?

source: KETIKA BERSAMAMU,
en: whenever I’m with you,

source: KULAPORKAN SEMUA-
en: I swear

source: HILANG?!
en: you’ve lost it?

source: ITU SI MACAN YANG TADI?
en: is he the tiger from earlier?

source: Aku ini berbeda denganmu!!
en: I’m totally different from you!

source: Tapi, syukurlah, tidak ada yang terluka..
en: but it’s a good thing no one got hurt.

source: NGOBROLNYA
en: have you

source: Ada apa ini, pak?
en: what’s happening here, sir?

source: KKHH-- GUH…
en: ecch... ah...

source: BILANG APA-APA SOAL
en: anything about

source: SENDIRI..
en: pfft... what a joke!

source: MALAM HARI PUN
en: each night

source: BIAR YANG
en: let the

source: Karena dianggap terlalu rakus dan ngabis-ngabisin mkanan, mulai hari ini tamu di kamar 203 akan dibatasi jumlah makannya, begitu..
en: ...the guest in room 203 had a reputation for being excessively greedy and wasteful, so they've decided to limit his food intake starting today.

source: BANGET, SIH!?
en: so persistent?!

source: MAH, LIHAT!
en: mom, look!

source: NGENG
en: vroom

source: NYAWA TANPA SEBAB
en: any clear

source: APA YANG KALIAN INGINKAN DARI KAMI!?
en: what are you after?!

source: SUDAH BERKALI-KALI DIKASIH TAHU MASIH SAJA NGGAK NGERTI-NGERTI..!!
en: I’ve told him over and over again! why doesn’t he get it?!

source: PUTRI SAYA PULANG,
en: take my baby daughter home?

source: KWAK
en: caw

source: ATAU MLM?
en: or was he in a pyramid scheme?

source: TCH…
en: tsk...

source: MENGUPING PEM-
en: your

source: HARUS AMBIL FOTO YANG BANYAK BIAR BISA POSTING #LATEPOST SETELAH LIBURAN INI...
en: after this, we should take a lot of photos to post with the hashtag #latepost.

source: WAHH!!
en: aaah

source: *ENDUS*
en: sniff

source: SINTING INI LAGI!!
en: problem anymore!

source: TUING
en: pop

source: Ada yang sakit??
en: are you feeling pain?

source: Diam kamu.
en: shut it.

source: INI SUDAH GELAP, TERLALU BERBAHAYA UNTUK ORANG AWAM SEPERTI BAPAK
en: it’s too dark out there, and it could be dangerous for someone without experience to--

source: INI DUIT BENERAN
en: are these real
